<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"d89f41ed97c743d8e3982340db161883d2cfc8df55781c5c99555d8564b72730","plan_job_ref":"Job Tests for PRs #135 at https://github.com/GSA-TTS/FAC/actions/runs/4876088672","plan_hash":"1d6f225e1453fa8f1f3d446d6f5840c10f5250f2eeab9b66beeaa1647ca631db","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 5 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.staging.cloudfoundry_app.postgrest will be created
  + resource "cloudfoundry_app" "postgrest" {
      + buildpack                       = (known after apply)
      + disk_quota                      = 256
      + docker_image                    = "postgrest/postgrest:v10.1.2"
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 128
      + name                            = "postgrest"
      + ports                           = (known after apply)
      + space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "blue-green"
      + timeout                         = 180

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.staging.cloudfoundry_app.swagger will be created
  + resource "cloudfoundry_app" "swagger" {
      + buildpack                       = (known after apply)
      + disk_quota                      = 256
      + docker_image                    = "swaggerapi/swagger-ui"
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "process"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 256
      + name                            = "swagger"
      + ports                           = (known after apply)
      + space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "blue-green"
      + timeout                         = 20

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.staging.cloudfoundry_route.postgrest will be created
  + resource "cloudfoundry_route" "postgrest" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "fac-staging-postgrest"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.cloudfoundry_route.swagger will be created
  + resource "cloudfoundry_route" "swagger" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "fac-staging-swagger"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.cloudfoundry_service_key.postgrest will be created
  + resource "cloudfoundry_service_key" "postgrest" {
      + credentials      = (sensitive value)
      + id               = (known after apply)
      + name             = "postgrest"
      + service_instance = "f247a56b-2a5f-4b20-82e7-3a7120d1b43a"
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
  ~ resource "cloudfoundry_app" "clamav_api" {
        id                              = "d1bea029-d2d3-4b68-b16d-b216bcaea573"
      ~ instances                       = 0 -> 1
        name                            = "fac-av-staging"
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Tests for PRs #135](https://github.com/GSA-TTS/FAC/actions/runs/4876088672)